print("Приветствуем вас в FitLife!")
print("Здесь позаботяться о вашем здоровье!")
user_name = input("Пожалуйста, введите ваше имя: ")
print(f"Рады видеть вас, {user_name}!")
user_age = int(input("Пожалуйста, введите ваш возраст: "))
print(
    f"Приятно познакомиться,{user_name}!"
    f"Вам {user_age} года",
)
print(
    "Давайте рассчитаем ваш индекс массы тела (BMI) и норму воды. "
    "Это нужно для того, чтобы оценить ваше здоровье",
)
user_height = float(
    input("Пожалуйста, введите ваш рост в метрах (например 1.75): ")
)
user_weight = float(
    input("Пожалуйста, введите ваш вес в килограммах (например 70): ")
)
bmi = user_weight / (user_height ** 2)
bmi = round(bmi, 1)
water_ml = user_weight * 30
water_l = water_ml / 1000
water_l = round(water_l, 1)
print(
    f"Отчет для пользователя {user_name}, {user_age} года:\n"
    f"Твой индекс массы тела (BMI): {bmi:.1f}\n"
    f"Рекомендуемая нормы воды: {water_l:.1f} литра в день.\n"
    f"Рассчет окончен. Спасибо за использование FitLife!\n"
    f"Желаем вам здоровья и успехов в достижении ваших целей!\n"
    f"Если у вас есть вопросы или предложения, пожалуйста\n"
    f"свяжитесь с нами по адресу kirillkochkin11@yandex.com\n"
    f"Рекомендуйте нас своим друзьям и близким!\n",
)
